import cls from './ArchSection.module.css'
import { EyeBrow } from '../EyeBrow'
import { Title } from '../Title'
import { Swiper, SwiperSlide } from 'swiper/react';
import 'swiper/css';
import img1 from './images/c99be4bad53a2dff228d7a188ca93941288e7fa8.png'
import img2 from './images/img.png'
import img3 from './images/069d120675fb5b16497dad1fef94b27620e4a90d.jpg'
import img4 from './images/fec0187a81cbfc1ac6e686e32a78e58eae9edd14.png'
import img5 from './images/b963f987d40f378970519590fd1f3c3c737047f6.jpg'
import img6 from './images/0de8d2ba1cb9da15d2276a8049b1488f5cad31d0.png'
import img7 from './images/90a3ba02b9f5ab235a351e2e267395f60627113d.jpg'
import img8 from './images/aa0e80179ad34ea0d690e022f2748664a5854af2.png'
import img9 from './images/f4441b85ff1a2cb2a41133d9fdc3d4842997190e.jpg'
import img10 from './images/45af3c289eaf3580e28d2678c6bb8954381e6320.png'

export const ArchSection = () =>{
    return(
        <section className={cls.archSectionWrapper}>
            <div className={cls.archSectionInner}>
                <div className={cls.archTitleBlock}>
                    <div>
                        <EyeBrow>
                            §3. Особенности
                        </EyeBrow>
                        <svg xmlns="http://www.w3.org/2000/svg" width="340" height="118" viewBox="0 0 340 118" fill="none">
                        <mask id="path-1-outside-1_110_376" maskUnits="userSpaceOnUse" x="-0.0959473" y="-0.279999" width="340" height="118" fill="black">
                            <rect fill="white" x="-0.0959473" y="-0.279999" width="340" height="118"/>
                            <path d="M272.089 71.9372H282.601V89.6015H295.6C309.781 89.6015 316.374 94.764 316.374 102.663C316.374 110.562 309.781 115.476 295.6 115.476H272.089V71.9372ZM326.264 115.476V71.9372H336.775V115.476H326.264ZM282.601 113.299H292.552C302.255 113.299 305.987 109.07 305.987 102.601C305.987 96.4433 302.255 91.7162 292.552 91.7162H282.601V113.299Z"/>
                            <path d="M207.573 84.5634L207.511 115.476H196.999V71.9372H210.372L226.854 113.175L243.399 71.9372H256.71V115.476H246.26L246.198 84.6256L231.27 115.476H222.438L207.573 84.5634Z"/>
                            <path d="M151.615 115.476H141.103V71.9372H163.868C177.925 71.9372 185.388 79.0278 185.388 86.8648C185.388 94.5774 177.925 101.917 163.868 101.917H151.615V115.476ZM151.615 99.7398H161.504C171.207 99.7398 174.877 93.3956 174.877 86.927C174.877 80.4583 171.269 74.1141 161.566 74.1141H151.615V99.7398Z"/>
                            <path d="M72.5926 93.2712C72.5926 79.6498 83.2907 70.7554 101.577 70.6932C119.863 70.6932 130.313 79.712 130.375 93.1468C130.437 106.519 120.05 116.72 101.515 116.72C83.2285 116.658 72.5926 106.768 72.5926 93.2712ZM101.639 114.543C113.644 114.543 119.863 102.974 119.863 93.3334C119.863 84.5012 114.701 72.8701 101.328 72.8701C88.1422 72.8701 83.1041 84.128 83.1041 92.898C83.1041 102.601 89.4483 114.543 101.639 114.543Z"/>
                            <path d="M27.7116 115.476V109.381C8.55445 109.256 0.904053 101.357 0.904053 93.4578C0.904053 85.994 8.30566 78.0326 27.7116 77.9704V71.9372H38.1609V77.9704C57.629 77.9704 64.9684 85.8696 64.9684 93.4578C64.9684 101.046 57.5668 109.318 38.1609 109.318V115.476H27.7116ZM38.1609 80.2095V107.079C52.1555 107.079 54.4569 97.5007 54.4569 93.3956C54.4569 88.9795 52.1555 80.2095 38.1609 80.2095ZM27.7116 107.141V80.2717C13.9035 80.3339 11.4156 88.6685 11.4156 93.3956C11.4156 97.5629 13.7169 107.141 27.7116 107.141Z"/>
                            <path d="M290.994 45.5028V1.96397H301.505V22.676H328.064V1.96397H338.576V45.5028H328.064V24.7908H301.505V45.5028H290.994Z"/>
                            <path d="M221.512 23.298C221.512 9.67657 232.21 0.782199 250.496 0.720001C268.782 0.720001 279.232 9.73877 279.294 23.1736C279.356 36.5463 268.969 46.7468 250.434 46.7468C232.147 46.6846 221.512 36.7951 221.512 23.298ZM250.558 44.5699C262.562 44.5699 268.782 33.001 268.782 23.3602C268.782 14.528 263.62 2.89694 250.247 2.89694C237.061 2.89694 232.023 14.1549 232.023 22.9248C232.023 32.6278 238.367 44.5699 250.558 44.5699Z"/>
                            <path d="M165.263 46.809C161.966 46.7468 158.608 46.187 155.871 45.1919L157.053 43.0149C158.856 44.1967 160.785 44.3833 161.966 44.3833C173.411 44.3833 171.98 21.7431 171.98 1.96397H209.61V45.5028H199.099V4.07872H182.43C182.43 28.7093 184.358 46.809 165.263 46.809Z"/>
                            <path d="M136.776 45.5028L131.863 31.5704H113.639L108.628 45.5028H97.3699L118.863 1.96397H126.638L147.937 45.5028H136.776ZM114.385 29.3313H131.116L122.72 5.63367L114.385 29.3313Z"/>
                            <path d="M52.7892 1.96397H101.428L100.495 4.07872H82.3956V45.5028H71.9463V4.07872H53.7843L52.7892 1.96397Z"/>
                            <path d="M53.7105 23.298C53.7105 35.7377 41.955 46.7468 24.8504 46.7468C13.8413 46.7468 5.56893 42.6417 0.904053 36.6707L3.88958 32.6278C8.30566 41.3356 16.5159 44.5699 23.9175 44.5699C34.9888 44.5699 42.266 34.0583 43.1368 24.7286H17.0134V22.7382H43.199C43.1368 13.9683 36.8547 2.89694 24.2285 2.89694C16.7646 2.89694 9.92282 4.26531 4.07617 13.4085L2.02362 8.99239C6.9373 3.95432 14.8365 0.720001 24.726 0.720001C41.7062 0.720001 53.7105 10.7339 53.7105 23.298Z"/>
                        </mask>
                        <path d="M272.089 71.9372H282.601V89.6015H295.6C309.781 89.6015 316.374 94.764 316.374 102.663C316.374 110.562 309.781 115.476 295.6 115.476H272.089V71.9372ZM326.264 115.476V71.9372H336.775V115.476H326.264ZM282.601 113.299H292.552C302.255 113.299 305.987 109.07 305.987 102.601C305.987 96.4433 302.255 91.7162 292.552 91.7162H282.601V113.299Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        <path d="M207.573 84.5634L207.511 115.476H196.999V71.9372H210.372L226.854 113.175L243.399 71.9372H256.71V115.476H246.26L246.198 84.6256L231.27 115.476H222.438L207.573 84.5634Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        <path d="M151.615 115.476H141.103V71.9372H163.868C177.925 71.9372 185.388 79.0278 185.388 86.8648C185.388 94.5774 177.925 101.917 163.868 101.917H151.615V115.476ZM151.615 99.7398H161.504C171.207 99.7398 174.877 93.3956 174.877 86.927C174.877 80.4583 171.269 74.1141 161.566 74.1141H151.615V99.7398Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        <path d="M72.5926 93.2712C72.5926 79.6498 83.2907 70.7554 101.577 70.6932C119.863 70.6932 130.313 79.712 130.375 93.1468C130.437 106.519 120.05 116.72 101.515 116.72C83.2285 116.658 72.5926 106.768 72.5926 93.2712ZM101.639 114.543C113.644 114.543 119.863 102.974 119.863 93.3334C119.863 84.5012 114.701 72.8701 101.328 72.8701C88.1422 72.8701 83.1041 84.128 83.1041 92.898C83.1041 102.601 89.4483 114.543 101.639 114.543Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        <path d="M27.7116 115.476V109.381C8.55445 109.256 0.904053 101.357 0.904053 93.4578C0.904053 85.994 8.30566 78.0326 27.7116 77.9704V71.9372H38.1609V77.9704C57.629 77.9704 64.9684 85.8696 64.9684 93.4578C64.9684 101.046 57.5668 109.318 38.1609 109.318V115.476H27.7116ZM38.1609 80.2095V107.079C52.1555 107.079 54.4569 97.5007 54.4569 93.3956C54.4569 88.9795 52.1555 80.2095 38.1609 80.2095ZM27.7116 107.141V80.2717C13.9035 80.3339 11.4156 88.6685 11.4156 93.3956C11.4156 97.5629 13.7169 107.141 27.7116 107.141Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        <path d="M290.994 45.5028V1.96397H301.505V22.676H328.064V1.96397H338.576V45.5028H328.064V24.7908H301.505V45.5028H290.994Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        <path d="M221.512 23.298C221.512 9.67657 232.21 0.782199 250.496 0.720001C268.782 0.720001 279.232 9.73877 279.294 23.1736C279.356 36.5463 268.969 46.7468 250.434 46.7468C232.147 46.6846 221.512 36.7951 221.512 23.298ZM250.558 44.5699C262.562 44.5699 268.782 33.001 268.782 23.3602C268.782 14.528 263.62 2.89694 250.247 2.89694C237.061 2.89694 232.023 14.1549 232.023 22.9248C232.023 32.6278 238.367 44.5699 250.558 44.5699Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        <path d="M165.263 46.809C161.966 46.7468 158.608 46.187 155.871 45.1919L157.053 43.0149C158.856 44.1967 160.785 44.3833 161.966 44.3833C173.411 44.3833 171.98 21.7431 171.98 1.96397H209.61V45.5028H199.099V4.07872H182.43C182.43 28.7093 184.358 46.809 165.263 46.809Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        <path d="M136.776 45.5028L131.863 31.5704H113.639L108.628 45.5028H97.3699L118.863 1.96397H126.638L147.937 45.5028H136.776ZM114.385 29.3313H131.116L122.72 5.63367L114.385 29.3313Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        <path d="M52.7892 1.96397H101.428L100.495 4.07872H82.3956V45.5028H71.9463V4.07872H53.7843L52.7892 1.96397Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        <path d="M53.7105 23.298C53.7105 35.7377 41.955 46.7468 24.8504 46.7468C13.8413 46.7468 5.56893 42.6417 0.904053 36.6707L3.88958 32.6278C8.30566 41.3356 16.5159 44.5699 23.9175 44.5699C34.9888 44.5699 42.266 34.0583 43.1368 24.7286H17.0134V22.7382H43.199C43.1368 13.9683 36.8547 2.89694 24.2285 2.89694C16.7646 2.89694 9.92282 4.26531 4.07617 13.4085L2.02362 8.99239C6.9373 3.95432 14.8365 0.720001 24.726 0.720001C41.7062 0.720001 53.7105 10.7339 53.7105 23.298Z" stroke="#A39F91" strokeWidth="1.44" mask="url(#path-1-outside-1_110_376)"/>
                        </svg>
                        <Title >
                            Архитектура
                        </Title>
                    </div>
                    <div>
                        <p>Пропустить блок</p>
                        <a>
                            <svg xmlns="http://www.w3.org/2000/svg" width="16" height="18" viewBox="0 0 16 18" fill="none">
                                <path d="M8 0.5V17.1667M8 17.1667L12 13.1667M8 17.1667L4 13.1667" stroke="#1D1D1B" strokeLinecap="round" strokeLinejoin="round"/>
                            </svg>
                        </a>
                    </div>
                </div>
                <div className={cls.archSlider}>
                        <Swiper
                            spaceBetween={84}
                            slidesPerView={2.4}
                            onSlideChange={() => console.log('slide change')}
                            onSwiper={(swiper) => console.log(swiper)}
                        >
                            <SwiperSlide>
                                <div className={cls.imgWrapper}>
                                    <img src={img1} alt="slider-img"/>
                                </div>
                                <div className={cls.sliderText}>
                                    <h3>Каркас — монолитный железобетон</h3>
                                    <p>
                                        Плитный фундамент, железобетонные
                                        перекрытия и утеплённые наружные стены с навесным вентилируемым фасадом обеспечивают жёсткость конструкции, долговечность и стабильный микроклимат.
                                    </p>
                                </div>
                            </SwiperSlide>
                            <SwiperSlide>
                                <img src={img2} alt="img" />
                            </SwiperSlide>
                            <SwiperSlide>
                                <div className={cls.imgWrapper}>
                                    <img src={img1} alt="slider-img"/>
                                </div>
                                <div className={cls.sliderText}>
                                    <h3>Премиальные натуральные материалы</h3>
                                    <p>
                                        Современные фасады ERDA выполнены в сдержанной палитре с использованием премиальных материалов – натурального гранита, алюминиевых композитов, медных вставок и витражных конструкций.
                                    </p>
                                </div>
                            </SwiperSlide>
                            <SwiperSlide>
                                <img src={img3} alt="slider-img"/>
                            </SwiperSlide>
                            <SwiperSlide>
                                <div className={cls.imgWrapper}>
                                    <img src={img4} alt="slider-img"/>
                                </div>
                                <div className={cls.sliderText}>
                                    <h3>Витражные системы</h3>
                                    <p>
                                        Витражные системы обеспечивают до 40% естественного освещения в помещениях.
                                    </p>
                                </div>
                            </SwiperSlide>
                            <SwiperSlide>
                                <img src={img5} alt="slider-img"/>
                            </SwiperSlide>
                            <SwiperSlide>
                                <div className={cls.imgWrapper}>
                                    <img src={img6} alt="slider-img"/>
                                </div>
                                <div className={cls.sliderText}>
                                    <h3>Коммерческие площади на 1-2 этаже</h3>
                                    <p>
                                        1–2 этажи — коммерческие площади с витринными окнами. Все что выше – офисные помещения.
                                    </p>
                                </div>
                            </SwiperSlide>
                            <SwiperSlide>
                                <img src={img7} alt="slider-img"/>
                            </SwiperSlide>
                            <SwiperSlide>
                                <div className={cls.imgWrapper}>
                                    <img src={img8} alt="slider-img"/>
                                </div>
                                <div className={cls.sliderText}>
                                    <h3>Комфорт во всем</h3>
                                    <p>
                                        Офисы от 80 до 1600 м² с возможностью объединения этажей, отдельные входные группы и лифтовые зоны.
                                    </p>
                                </div>
                            </SwiperSlide>
                            <SwiperSlide>
                                <img src={img9} alt="slider-img"/>
                            </SwiperSlide>
                            <SwiperSlide>
                                <div className={cls.imgWrapper}>
                                    <img src={img10} alt="slider-img"/>
                                </div>
                                <div className={cls.sliderText}>
                                    <h3>Территория вокруг — продолжение архитектуры</h3>
                                    <p>
                                        Озеленение, продуманные пешеходные маршруты, уличная мебель и акцентное фасадное и ландшафтное освещение.
                                    </p>
                                </div>
                            </SwiperSlide>
                        </Swiper>

                </div>
            </div>
        </section>
    )
}